In [1]:
import pandas as pd

In [2]:
employees = {
    "imie" : ["Jan", "Paweł", "Piotr", "Adam"],
    "nazwisko" : ["Kowalski", "Nowak", "Zieliński", "Martyniuk"],
    "rok urodzenia": [1970, 1981, 1974, 1969]
}
employees

{'imie': ['Jan', 'Paweł', 'Piotr', 'Adam'],
 'nazwisko': ['Kowalski', 'Nowak', 'Zieliński', 'Martyniuk'],
 'rok urodzenia': [1970, 1981, 1974, 1969]}

In [3]:
df = pd.DataFrame(employees)
df

    imie   nazwisko  rok urodzenia
0    Jan   Kowalski           1970
1  Paweł      Nowak           1981
2  Piotr  Zieliński           1974
3   Adam  Martyniuk           1969

In [4]:
type(df)

pandas.core.frame.DataFrame

In [6]:
list(df.index)

[0, 1, 2, 3]

In [7]:
df.columns

Index(['imie', 'nazwisko', 'rok urodzenia'], dtype='object')

In [9]:
type(df["imie"])

pandas.core.series.Series

In [10]:
df.nazwisko

0     Kowalski
1        Nowak
2    Zieliński
3    Martyniuk
Name: nazwisko, dtype: object

In [12]:
df.columns[2] = "rok_urodzenia"

TypeError: Index does not support mutable operations

In [13]:
df.columns = ['imie', 'nazwisko', 'rok_urodzenia']
df

    imie   nazwisko  rok_urodzenia
0    Jan   Kowalski           1970
1  Paweł      Nowak           1981
2  Piotr  Zieliński           1974
3   Adam  Martyniuk           1969

In [17]:
df[ ["rok_urodzenia","imie"] ]

   rok_urodzenia   imie
0           1970    Jan
1           1981  Paweł
2           1974  Piotr
3           1969   Adam

In [21]:
import datetime
df["wiek"] = datetime.datetime.now().year - df.rok_urodzenia

In [22]:
df

    imie   nazwisko  rok_urodzenia  wiek
0    Jan   Kowalski           1970    51
1  Paweł      Nowak           1981    40
2  Piotr  Zieliński           1974    47
3   Adam  Martyniuk           1969    52

In [23]:
del(df["wiek"])
df

    imie   nazwisko  rok_urodzenia
0    Jan   Kowalski           1970
1  Paweł      Nowak           1981
2  Piotr  Zieliński           1974
3   Adam  Martyniuk           1969

In [24]:
df.values

array([['Jan', 'Kowalski', 1970],
       ['Paweł', 'Nowak', 1981],
       ['Piotr', 'Zieliński', 1974],
       ['Adam', 'Martyniuk', 1969]], dtype=object)